/*숫자나라 기사단의 각 기사에게는 1번부터 number까지 번호가 지정되어 있습니다. 기사들은 무기점에서 무기를 구매하려고 합니다.

각 기사는 자신의 기사 번호의 약수 개수에 해당하는 공격력을 가진 무기를 구매하려 합니다. 단, 이웃나라와의 협약에 의해 공격력의 제한수치를 정하고, 제한수치보다 큰 공격력을 가진 무기를 구매해야 하는 기사는 협약기관에서 정한 공격력을 가지는 무기를 구매해야 합니다.

예를 들어, 15번으로 지정된 기사단원은 15의 약수가 1, 3, 5, 15로 4개 이므로, 공격력이 4인 무기를 구매합니다. 만약, 이웃나라와의 협약으로 정해진 공격력의 제한수치가 3이고 제한수치를 초과한 기사가 사용할 무기의 공격력이 2라면, 15번으로 지정된 기사단원은 무기점에서 공격력이 2인 무기를 구매합니다. 무기를 만들 때, 무기의 공격력 1당 1kg의 철이 필요합니다. 그래서 무기점에서 무기를 모두 만들기 위해 필요한 철의 무게를 미리 계산하려 합니다.

기사단원의 수를 나타내는 정수 number와 이웃나라와 협약으로 정해진 공격력의 제한수치를 나타내는 정수 limit와 제한수치를 초과한 기사가 사용할 무기의 공격력을 나타내는 정수 power가 주어졌을 때, 무기점의 주인이 무기를 모두 만들기 위해 필요한 철의 무게를 return 하는 solution 함수를 완성하시오.

 */

function solution(number, limit, power) {
  //필요한 철의 무게를 저장할 변수 answer
  let answer = 0;

  //기사단원 수만큼 반복
  for (let i = 1; i <= number; i++) {
    //약수의 개수를 저장할 변수 cnt
    let cnt = 0;
    //약수의 개수를 구하는 방식은
    //해당 수의 제곱근부터 시작해서 1로 내려간다.
    //만약 해당 수를 약수로 나눴을 떄 나누어 떨어진다면 cnt에 개수를 추가한다.
    //ex) 16 / 4 = 4 일 때처럼 j가 i의 제곱근일 경우 약수의 개수는 1개, 그게 아니라면 2개를 더한다.

    //EX)15라면 3부터 시적, (3,5) (1,15) 총 4개
    //EX)16이면 4부터 시작, (4) (2,8) (1,16) 총 5개.
    for (let j = Math.floor(Math.sqrt(i)); j >= 1; j--) {
      if (i % j === 0) {
        cnt += i / j !== j ? 2 : 1;
      }
    }

    //약수의 개수를 다 구했지만, 해당 수(= 공격력)이 limit을 넘어서면 정해진 수(=power)만큼의 무게를 지닌 무기를 만든다.
    //만약 limit을 넘지 않았다면 해당 공격력만큼의 무게만큼 철을 쓰면 된다.
    if (cnt > limit) answer += power;
    else answer += cnt;
  }

  return answer;
}
